test/result-example/ab/http/process/TestResult-10.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        myserver/1.0
Server Hostname:        localhost
Server Port:            8889

Document Path:          /testing.txt
Document Length:        22 bytes

Concurrency Level:      10
Time taken for tests:   2.685 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      159000 bytes
HTML transferred:       22000 bytes
Requests per second:    372.49 [#/sec] (mean)
Time per request:       26.847 [ms] (mean)
Time per request:       2.685 [ms] (mean, across all concurrent requests)
Transfer rate:          57.84 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    7  85.0      0    1019
Processing:     3   11  79.8      6    1662
Waiting:        3   11  79.8      6    1662
Total:          3   18 152.4      6    2681

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      6
  75%      6
  80%      7
  90%      7
  95%      8
  98%      9
  99%     10
 100%   2681 (longest request)